/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "Ligado";
"general.off" = "Desligado";
"general.login" = "Iniciar sessão";
"general.logout" = "Terminar sessão";
"general.ok" = "OK";
"general.cancel" = "Cancelar";
"general.username" = "Nome de Utilizador";
"general.password" = "Senha";
"general.na" = "N/A";

"input.value_is_empty" = "Nome não pode ser vazio.";
"input.already_exists" = "Nome já existe.";

// Guide Window
"guide.highlights" = "Destaques";
"guide.basic_settings" = "Configurações Básicas";
"guide.faq" = "Perguntas Frequentes";

// Initial Window
"initial.announcement" = "Está a usar a versão %@ do IINA";
"initial.beta.desc" = "Para reverter para uma versão anterior desmarque \"Receber Atualizações beta\" a partir de Definições... > Geral, e instale a versão pretendida através do nosso <a href=\"https://iina.io\">site oficial</a>.";
"initial.nightly.desc" = "Não é recomendado que use Nightly no dia a dia. As versões Nightly não suportam atualizações automáticas. Descarregue novas versões manualmente do nosso <a href=\"https://nightly.iina.io\">website nightly</a>.";
"initial.debug.desc" = "Compilações para depuração não estão otimizadas para velocidade, por isso não é recomendado que a use no dia a dia. Compilações para depuração não suportam atualizações automáticas.";
"initial.bug_report" = "Reporte através <a href=\"https://github.com/iina/iina/issues\">GitHub Issues</a>.";

// Inspector Window
"inspector.error" = "Erro";

// MainWindowController.swift
"main.buffering_indicator" = "A carregar… %d%%";
"main.opening_stream" = "A abrir stream…";
"main.seeking_indicator" = "Seeking…";
"osc.precision" = "Precisão";
"osc.1s" = "1 segundo";
"osc.100ms" = "100 milissegundos";
"osc.10ms" = "10 milissegundos";
"osc.1ms" = "1 milissegundo";

// QuickSettingViewController.swift
"quicksetting.item_default" = "Predefinido";
"quicksetting.item_none" = "Nenhum";
"quicksetting.hwdec" = "Descodificação de hardware";
"quicksetting.deinterlace" = "Desentrelaçar";
"quicksetting.hdr" = "HDR";
"quicksetting.hide" = "Ocultar";
"quicksetting.reset_speed" = "Redefinir velocidade para 1x";

// EQ Presets
"eq.preset.flat" = "Neutro";
"eq.preset.acoustic" = "Acústico";
"eq.preset.classical" = "Clássico";
"eq.preset.dance" = "Dança";
"eq.preset.deep" = "Deep";
"eq.preset.electronic" = "Eletrónica";
"eq.preset.hip_hop" = "Hip-hop";
"eq.preset.increase_bass" = "Increase Bass";
"eq.preset.increase_treble" = "Increase Treble";
"eq.preset.increase_vocal" = "Increase Vocal";
"eq.preset.jazz" = "Jazz";
"eq.preset.latin" = "Latin";
"eq.preset.loundness" = "Loundness";
"eq.preset.lounge" = "Lounge";
"eq.preset.piano" = "Piano";
"eq.preset.pop" = "Pop";
"eq.preset.rnb" = "R&B";
"eq.preset.reduce_bass" = "Reduce Bass";
"eq.preset.reduce_treble" = "Reduce Treble";
"eq.preset.rock" = "Rock";
"eq.preset.small_speaker" = "Small Speaker";
"eq.preset.spoken_word" = "Spoken Word";

"alert.eq.new_profile.title" = "Novo perfil EQ";
"alert.eq.new_profile.message" = "Introduza o nome do perfil.";
"alert.eq.rename.title" = "Alterar nome do perfil";
"alert.eq.rename.message" = "Introduza o novo nome do perfil.";

// OSDMessage.swift
"osd.pause" = "Pausa";
"osd.resume" = "Retomar";
"osd.volume" = "Volume: %@";
"osd.speed" = "Velocidade: %@x";
"osd.aspect" = "Proporção: %@";
"osd.crop" = "Cortar: %@";
"osd.rotate" = "Rodar: %i°";
"osd.deinterlace" = "Desentrelaçar: %@";
"osd.hwdec" = "Descodificação de Hardware: %@";
"osd.audio_delay.nodelay" = "Atraso de Áudio: Sem Atraso";
"osd.audio_delay.later" = "Atraso de Áudio: %@s Depois";
"osd.audio_delay.earlier" = "Atraso de Áudio: %@s Antes";
"osd.sub_delay.nodelay" = "Atraso da legenda: Sem atraso";
"osd.sub_delay.later" = "Atraso da legenda: %@s Depois";
"osd.sub_delay.earlier" = "Atraso da Legenda: %@s Antes";
"osd.subtitle_pos" = "Posição da Legenda: %@";
"osd.sub_hidden" = "Legendas ocultas";
"osd.sub_visible" = "Legendas visíveis";
"osd.sub_second_delay.nodelay" = "Atraso da legenda secundária: Sem atraso";
"osd.sub_second_delay.later" = "Atraso da legenda secundária: %@s Depois";
"osd.sub_second_delay.earlier" = "Atraso da legenda secundária: %@s Antes";
"osd.sub_second_hidden" = "Legendas secundárias ocultas";
"osd.sub_second_pos" = "Posição da legenda secundária: %@";
"osd.sub_second_visible" = "Legendas secundárias visíveis";
"osd.mute" = "Sem som";
"osd.unmute" = "Ligar som";
"osd.screenshot" = "Captura de ecrã efetuada";
"osd.abloop.a" = "Loop-AB: A";
"osd.abloop.b" = "Loop-AB: B";
"osd.abloop.clear" = "Loop-AB: Limpo";
"osd.stop" = "Parar";
"osd.chapter" = "Capítulo: %@";
"osd.subtitle_scale" = "Tamanho da legenda: %@x";
"osd.add_to_playlist" = "%i Ficheiros Adicionados à Playlist";
"osd.clear_playlist" = "Lista de Reprodução Limpa";
"osd.video_eq.contrast" = "Contraste: %i";
"osd.video_eq.gamma" = "Gamma: %i";
"osd.video_eq.hue" = "Tonalidade: %i";
"osd.video_eq.saturation" = "Saturação: %i";
"osd.video_eq.brightness" = "Luminosidade: %i";
"osd.find_online_sub" = "A encontrar legendas online…";
"osd.find_online_sub.source" = "de";
"osd.sub_not_found" = "Não foram encontradas legendas";
"osd.sub_found" = "%d legendas encontradas.";
"osd.sub_downloading" = "Descarregando %d legendas";
"osd.sub_downloaded" = "Legenda transferida";
"osd.sub_saved" = "Legenda guardada";
"osd.network_error" = "Erro de Rede";
"osd.file_error" = "Erro ao ler o ficheiro";
"osd.cannot_login" = "Impossível iniciar sessão";
"osd.canceled" = "Cancelado";
"osd.cannot_connect" = "Cannot connect";
"osd.timed_out" = "Timed Out";
"osd.filter_added" = "Filtro Adicionado: %@";
"osd.filter_removed" = "Filtro Removido";
"osd.file_loop" = "Loop Single File";
"osd.playlist_loop" = "Repetir lista de reprodução";
"osd.no_loop" = "Desativar Repetição";

"preference.title" = "Definições";
"preference.general" = "Geral";
"preference.ui" = "Interface";
"preference.video_audio" = "Vídeo/Áudio";
"preference.subtitle" = "Legenda";
"preference.network" = "Rede";
"preference.control" = "Controlo";
"preference.keybindings" = "Atalhos";
"preference.advanced" = "Avançado";
"preference.plugins" = "Plugins";
"preference.utilities" = "Utilidades";
"preference.scripts" = "Scripts";
"preference.not_logged_in" = "Sem sessão iniciada";
"preference.logged_in_as" = "Sessão iniciada como %@";
"preference.system_media_control" = "Usar controle de mídia do sistema";

"preference.key_binding_hint_1" = "Para editar mapeamento de teclas no arquivo de configuração atual, clique no botão \"Duplicar…\" primeiro para criar uma cópia.";
"preference.key_binding_hint_2" = "Clique duas vezes em uma linha no lado direito para editar o mapeamento de tecla correspondente.";

"preference.enable_adv_settings" = "Ativar configurações avançadas";

"preference.sub_override_level.no" = "no";
"preference.sub_override_level.force" = "force";
"preference.sub_override_level.scale" = "scale";
"preference.sub_override_level.strip" = "faixa";
"preference.sub_override_level.yes" = "yes";

"preference.sub_override_level.descriptive_text.no" = "Render subtitles as specified by the subtitle scripts, without overrides.";
"preference.sub_override_level.descriptive_text.force" = "Apply all subtitle styles.";
"preference.sub_override_level.descriptive_text.scale" = "Apply the scale setting in addition to the style settings in this section.";
"preference.sub_override_level.descriptive_text.strip" = "Radically strip all ASS tags and styles from the subtitle.";
"preference.sub_override_level.descriptive_text.yes" = "Apply all the style settings in this section.";

"preference.ytdl_plugin_not_installed" = "Install the Online Media plugin from \"Plugins > Install from GitHub\" to enjoy advanced features such and video downloading and auto yt-dlp updates.";
"preference.ytdl_plugin_installed" = "The built-in youtube-dl support is disabled since you have the Online media plugin installed.";

"menu.volume" = "Volume: %@";
"menu.volume_muted" = "Volume: %@ (Sem som)";
"menu.audio_delay" = "Atraso de Áudio: %@s";
"menu.sub_delay" = "Atraso da legenda: %@s";
"menu.sub_hide" = "Ocultar legendas";
"menu.sub_show" = "Mostrar legendas";
"menu.sub_second_hide" = "Ocultar legendas secundárias";
"menu.sub_second_show" = "Mostrar legendas secundárias";
"menu.fullscreen" = "Entrar em Ecrã Completo";
"menu.exit_fullscreen" = "Sair do Ecrã Completo";
"menu.pip" = "Usar Picture in Picture";
"menu.exit_pip" = "Sair do Picture in Picture";
"menu.mini_player" = "Enter Music Mode";
"menu.exit_mini_player" = "Exit Music Mode";
"menu.pause" = "Pausa";
"menu.resume" = "Retomar";
"menu.speed" = "Velocidade: %@x";
"menu.chapters" = "Mostrar painel de capítulos";
"menu.hide_chapters" = "Hide Chapters Panel";
"menu.playlist" = "Mostrar Painel da Lista de Reprodução";
"menu.hide_playlist" = "Hide Playlist Panel";
"menu.video" = "Mostrar painel de vídeo";
"menu.hide_video" = "Ocultar painel de vídeo";
"menu.audio" = "Mostrar painel de áudio";
"menu.hide_audio" = "Ocultar painel de áudio";
"menu.subtitles" = "Mostrar painel de legendas";
"menu.hide_subtitles" = "Ocultar painel de legendas";

"menu.seek_forward" = "Avançar %@s";
"menu.seek_backward" = "Recuar %@s";
"menu.speed_up" = "Acelerar em %@x";
"menu.speed_down" = "Desacelerar em %@x";
"menu.volume_up" = "Volume + %@%%";
"menu.volume_down" = "Volume - %@%%";
"menu.audio_delay_up" = "Atraso do áudio + %@s";
"menu.audio_delay_down" = "Atraso de Áudio - %@s";
"menu.sub_delay_up" = "Atraso da legenda + %@s";
"menu.sub_delay_down" = "Atraso da legenda - %@s";

"menu.crop_custom" = "Personalizado…";
"menu.find_online_sub" = "Find Online Subtitles from %@";

"menu.manage_plugins" = "Manage Plugins…";
"menu.developer_tool" = "Developer Tool";
"menu.more_plugin" = "More…";
"menu.conflicting_shortcuts" = "Conflicting key shortcuts…";
"menu.reload_plugins" = "Recarregar todos os Plugins";
"menu.show_plugins_panel" = "Show Plugins Panel";
"menu.hide_plugins_panel" = "Hide Plugins Panel";

"track.audio" = "Áudio";
"track.none" = "<None>";
"track.sub" = "Legenda";
"track.video" = "Vídeo";

"subtrack.no_loaded" = "Nenhuma Legenda Carregada";
"subtrack.no_external" = "Nenhuma Legenda Externa Encontrada";

// Alerts
"alert.beta_channel.title" = "Receber Atualizações beta";

"alert.title_error" = "Erro";
"alert.title_warning" = "Aviso";
"alert.title_info" = "Informação";

"alert.fatal_error" = "Erro fatal: %@ \nA aplicação vai ser encerrada agora.";
"alert.mpv_error" = "Erro interno %@ (%@) ao definir a opção %@.";

"alert.unsupported_audio" = "Ficheiro de áudio externo não suportado.";
"alert.unsupported_video" = "Unsupported external video file.";
"alert.unsupported_sub" = "Legenda externa não suportada.";
"alert.unsupported_url" = "URL não suportado.";
"alert.wrong_url_format" = "Formato do URL errado.";

"alert.error_open" = "Impossível abrir ficheiro ou stream!";
"alert.error_finding_file" = "Impossível encontrar o ficheiro %@!";
"alert.error_loading_script" = "Impossível carregar o script %@!";
"alert.error_saving_file" = "Ocorreu um erro ao salvar %@: %@";
"alert.error_deleting_file" = "Não foi possível apagar o ficheiro.";

"alert.target_peak.bad_value" = "The value \"%@\" is invalid.\nPlease provide a value between 10 and 10000, or 0.";

"alert.config.new.title" = "Nova configuração";
"alert.config.new.message" = "Por favor digite um nome para a nova configuração.";
"alert.config.duplicate.title" = "Duplicar Configuração";
"alert.config.duplicate.message" = "Por favor digite o nome para o arquivo de configuração duplicado.";
"alert.config.file_existing.title" = "Ficheiro já existe";
"alert.config.file_existing.message" = "A config file with the same filename already exists. Choose OK to show the file in Finder.";
"alert.config.cannot_create" = "Não foi possível criar um ficheiro de configuração!\n%@";
"alert.config.cannot_write" = "Não foi possível escrever no arquivo de configuração!";
"alert.config.rename.title" = "Rename Input Configuration";
"alert.config.rename.message" = "Please enter the new name for the configuration.";

"alert.filter.incorrect" = "Ocorreu um erro ao configurar os filtros. Por favor, verifique o formato de seu parâmetro.";
"alert.add_filter.title" = "Novo Filtro";
"alert.add_filter.message" = "Por favor, digite uma string de filtro no formato de comando vf ou af de mpv.";

"alert.keybinding_config.error" = "Erro ao analisar o arquivo de configuração de mapeamento de teclas \"%@\"! Volte para a configuração do padrão mapeamento de teclas do IINA. Por favor, verifique sua configuração.";

"alert.extra_option.cannot_read" = "Não é possível ler opções mpv definidas pelo usuário.";
"alert.extra_option.empty" = "Chave ou valor não pode estar vazio!";
"alert.extra_option.error" = "Erro ao definir opção --%@=%@ com valor de retorno %d. Por favor, verifique as suas opções extra em Preferência > Avançado.";
"alert.extra_option.config_folder" = "Erro na configuração da pasta \"%@\".";

"alert.playlist.error_deleting" = "Erro ao apagar: %@";

"alert.screenshot.error_taking" = "Cannot take a screenshot!";

"alert.sub.no_selected" = "Por favor, seleccione uma legenda transferida primeiro.";
"alert.sub_lang_not_set" = "Por favor, defina os idiomas de legenda preferidos nas preferências antes de usar o OpenSubtitles. Inglês (eng) será usado desta vez.";
"alert.sub.cannot_save_passwd" = "Não é possível guardar a palavra-passe no Porta-chaves: %@";
"alert.sub.cannot_login" = "Impossível iniciar sessão. Por favor verifique o seu nome de utilizador, palavra-passe e estado da rede.\n\n%@";
"alert.sub.save_downloaded.title" = "Guardar legenda transferida";

"alert.set_default.title" = "Definir IINA como Aplicação Predefinida";
"alert.set_default.message" = "O IINA será definido como o aplicativo padrão para todos os tipos de arquivo que ele suporta.";
"alert.set_default.success" = "Terminado com %d de sucesso e %d de falhas.";

"alert.add_watch.title" = "Adicionar Propriedade de Relógio";
"alert.add_watch.message" = "Por favor, insira um nome de propriedade mpv válido.";

"alert.jump_to.title" = "Saltar para";
"alert.jump_to.message" = "Por favor, introduza o tempo para qual quer saltar. Exemplo: 20:35";

"alert.opensub.login.title" = "Login OpenSubtitles";
"alert.opensub.login.message" = "Por favor, introduza um nome de utilizador e palavra-passe";

"alert.open_url.title" = "Abrir URL";
"alert.open_url.message" = "Por favor, introduza um URL:";
"alert.choose_media_file.title" = "Escolher Arquivos de Media";

"alert.add_url.title" = "Adicionar URL";
"alert.add_url.message" = "Por favor, insira um URL:";

"alert.delete_history.title" = "Apagar Histórico de Reprodução";
"alert.delete_history.message" = "Tem a certeza que quer apagar as entradas selecionadas?";

"alert.filter_hwdec.message" = "Está prestes a aplicar um filtro de vídeo. No entanto, o seu descodificador de hardware atual pode não suportar bem filtros de vídeo. Pode desativar a descodificação de hardware ou alternar para Auto(Copiar), que irá consumir o dobro da memória.\nPoderá precisar de repetir a operação anterior (como definir o corte) para que funcione.";
"alert.filter_hwdec.abort" = "Abortar";
"alert.filter_hwdec.turn_off" = "Desativar decodificação de hardware";
"alert.filter_hwdec.use_copy" = "Mudar para Auto(Copiar)";

"alert.clear_cache.title" = "Limpar Cache de Miniaturas";
"alert.clear_cache.message" = "Tem a certeza que pretende limpar toda a cache de thumbnails?";

"alert.clear_history.title" = "Limpar Histórico de Reprodução";
"alert.clear_history.message" = "Tem a certeza que quer apagar todo o histórico de reprodução?";

"alert.clear_watch_later.title" = "Limpar progresso de reprodução guardado";
"alert.clear_watch_later.message" = "Tem a certeza que quer apagar todo o progresso de reprodução gravado (dados do \"ver mais tarde\")?";

"alert.restore_alerts.title" = "Restore Suppressed Alerts";
"alert.restore_alerts.message" = "Are you sure you want to restore suppressed alerts?";

"alert.nothing_to_open" = "Nada para abrir.";

"alert.no_video_track" = "Não existe faixa de vídeo.";

"alert.duplicate_config" = "Não é possível editar configurações padrão diretamente. Por favor, duplique uma antes de editar.";

"alert.assrt_register" = "Devido a uma cota limitada da API, é altamente recomendável usar seu próprio token de API. O token padrão é apenas para uso de demonstração, e você pode encontrar um erro de rede.";
"alert.assrt_register.register" = "Registe-se Agora";
"alert.assrt_register.try" = "Tentar primeiro";
"alert.assrt_token_prompt.title" = "Digite o seu token de API";
"alert.assrt_token_prompt.message" = "Por favor registe-se na página aberta. Pegue no seu token na sua página inicial de usuário e insira-o abaixo:";
"alert.assrt_token_invalid" = "O seu token Assrt API parece ser inválido.";

"alert.plugin_uninstall.title" = "Are you sure to uninstall %@?";
"alert.plugin_uninstall.message" = "The plugin will be deleted from your disk.";
"alert.plugin_reinstall.title" = "Plugin %@ already exists";
"alert.plugin_reinstall.message" = "Do you want to reinstall the plugin?";
"alert.duplicated_plugin_id" = "Duplicated plugin identifiers detected. Two or more plugins have the same identifier \"%@\". This may cause abnormal behaviors. Please find them in Preferences - Plugins and report to their authors. If a plugin is installed locally, you can also manually change its identifier in the plugin's Info.json file.";
"alert.plugin_no_update" = "No update found.";
"alert.plugin_update_found.title" = "Update found for %@";
"alert.plugin_update_found.message" = "The latest version is %@. You have %@. Would you like to update?";
"alert.plugin_permission" = "This plugin requires the following permissions. Please review them before proceeding.";
"alert.plugin_permission_added" = "This update requires additional permissions. Please review them before proceeding.";

"playlist.total_length" = "%@ no total";
"playlist.total_length_with_selected" = "%@ de %@ selecionado";
"playlist.sorting.header" = "Sorting";
"playlist.sorting.filename_ascending" = "Filename Ascending";
"playlist.sorting.filename_descending" = "Filename Descending";
"playlist.sorting.path_ascending" = "File Path Ascending";
"playlist.sorting.path_descending" = "File Path Descending";
"pl_menu.title_multi" = "%d itens";
"pl_menu.play_next" = "Reproduzir Seguinte";
"pl_menu.play_in_new_window" = "Reproduzir numa Nova Janela";
"pl_menu.remove" = "Remover";
"pl_menu.remove_multi" = "Remover selecionado";
"pl_menu.delete" = "Mover para o Lixo";
"pl_menu.delete_multi" = "Mover Ficheiros Selecionados para o Lixo";
"pl_menu.delete_after_play" = "Mover para o Lixo depois da Reprodução";
"pl_menu.delete_after_play_multi" = "Mover Ficheiros Selecionados para o Lixo depois da Reprodução";
"pl_menu.show_in_finder" = "Mostrar no Finder";
"pl_menu.add_file" = "Adicionar Ficheiro…";
"pl_menu.add_url" = "Adicionar URL…";
"pl_menu.clear_playlist" = "Limpar Lista de Reprodução";
"pl_menu.matched_sub" = "%d Legenda(s) correspondentes";
"pl_menu.add_sub" = "Adicionar Legenda…";
"pl_menu.wrong_sub" = "Legenda Errada!";
"pl_menu.browser" = "Abrir no Navegador";
"pl_menu.copy_url" = "Copiar URL";
"pl_menu.copy_url_multi" = "Copiar URLs";

"keymapping.title" = "Mapeamento de teclas";
"keymapping.message" = "Pressione qualquer tecla para gravar.";

"filter.video_filters" = "Filtros de Vídeo";
"filter.audio_filters" = "Filtros de Áudio";

"hwdec.no" = "Desativar decodificador de hardware.";
"hwdec.auto" = "Activar descodificação por hardware. No entanto, a maioria dos filtros de vídeo não funcionarão corretamente.";
"hwdec.auto-copy" = "Ativar descodificação por hardware. Consumirá o dobro da memória mas trabalhará com filtros de vídeo.";

"gaplessAudio.no" = "Playback of consecutive audio files may result in silence or disruption at the point of file change.";
"gaplessAudio.weak" = "If the audio format the decoder output changes, the audio device is closed and reopened, disrupting gapless playback.";
"gaplessAudio.yes" = "The audio device is opened using parameters chosen for the first file played and is then kept open for gapless playback. Following files may be resampled.";

"subencoding.auto" = "Detectar automaticamente";

"osc_toolbar.settings" = "Definições Rápidas";
"osc_toolbar.playlist" = "Lista de reprodução e capítulos";
"osc_toolbar.pip" = "Alternar Picture-in-Picture";
"osc_toolbar.full_screen" = "Alternar ecrã completo";
"osc_toolbar.music_mode" = "Entrar no modo música";
"osc_toolbar.sub_track" = "Selecionar faixa de legenda";
"osc_toolbar.screenshot" = "Take a screenshot";
"osc_toolbar.plugins" = "Show plugins panel";

"mini_player.album_art" = "Alternar arte do álbum";
"mini_player.loop" = "Repetir";
"mini_player.shuffle" = "Aleatório";
"mini_player.remove" = "Remover da playlist";
"mini_player.add" = "Adicionar à playlist";
"mini_player.delete" = "Excluir todas as faixas da playlist";
"mini_player.volume" = "Volume";
"mini_player.close" = "Fechar modo de música";
"mini_player.back" = "Retornar ao modo vídeo";
"mini_player.sort" = "Sort the playlist";

// Touch bar

"touchbar.ahead_15" = "15s Depois";
"touchbar.ahead_30" = "30s Depois";
"touchbar.back_15" = "15s Antes";
"touchbar.back_30" = "30s Antes";
"touchbar.next_video" = "Próximo Vídeo";
"touchbar.prev_video" = "Vídeo Anterior";
"touchbar.increase_volume" = "Volume +";
"touchbar.decrease_volume" = "Volume -";
"touchbar.rewind" = "Recuar";
"touchbar.fast_forward" = "Avançar rápido";
"touchbar.play_pause" = "Reproduzir / Pausa";
"touchbar.seek" = "Procurar";
"touchbar.time" = "Posição Temporal";
"touchbar.remainingTimeOrTotalDuration" = "Tempo Restante / Duração Total";
"touchbar.toggle_pip" = "Alternar Picture-in-Picture";

// Plugin permissions

"permissions.network-request.name" = "Network Request";
"permissions.network-request.desc" = "This plugin can make requsts from or upload data to these websites:";
"permissions.network-request.any_site" = "Any site";
"permissions.show-osd.name" = "Show OSD";
"permissions.show-osd.desc" = "This plugin can show OSD (On Screen Display) messages.";
"permissions.show-alert.name" = "Show Alerts";
"permissions.show-alert.desc" = "This plugin can show pop-up alerts.";
"permissions.video-overlay.name" = "Add overlays on videos";
"permissions.video-overlay.desc" = "This plugin can render additional content on the top of the video.";
"permissions.file-system.name" = "Access the file system";
"permissions.file-system.desc" = "This plugin can read or write files on your disk, which may include sensitive information. It can also execute other programs or applications that can harm your computer. So be sure to verify the source.";

"plugin.install" = "Instalar";
"plugin.installed" = "Instalado";
"plugin.not_installed" = "Não instalado";
"plugin.local" = "Instalado localmente";
"alert.plugin.install_error" = "Ocorreu um erro durante a instalação: %@";
"alert.invalid_url" = "O URL é inválido.";
"plugin.install_error.invalid_url" = "O URL é inválido.";
"plugin.install_error.file_not_found" = "Cannot find the package file.";
"plugin.install_error.cannot_download" = "Failed to download the plugin.\n\nOutput:%@\n";
"plugin.install_error.cannot_unpackage" = "Failed to unpackage the plugin.\n\nOutput:%@\n";
"plugin.install_error.cannot_load" = "IINA cannot load this plugin. It might be in the wrong format.";
"plugin.check_for_updates" = "Procurar atualizações";
"plugin.updating" = "Downloading update…";
